{"posts":[{"title":"BigQuery Billing Disaster How a Simple Query Cost 15000 and How to Prevent It","text":"AbstractA New Zealand company’s routine BigQuery analytics query unexpectedly generated a $15,500 bill overnight, highlighting critical gaps in cloud cost protection mechanisms and the urgent need for proper safeguards. This case study examines how a simple data comparison task escalated into a financial disaster and provides actionable solutions to prevent similar incidents. The Incident: From Routine Analytics to Financial CatastropheA small New Zealand-based company experienced every cloud developer’s worst nightmare: a routine BigQuery operation that had been running successfully for months suddenly generated an astronomical bill of NZ$15,500 in a single day. The company was performing standard Google Analytics to BigQuery data analysis, comparing timezone differences between event_timestamp and event_date fields in Looker Studio. This was not experimental or high-volume processing—it was routine maintenance that had previously cost only tens of dollars monthly. The Query That Broke the BankThe problematic query structure reveals how seemingly innocent operations can spiral out of control: 123456789101112131415161718192021SELECT TIMESTAMP_MICROS(event_timestamp) as event_timestamp, event_name, name, medium, source, region, countryFROM `{bigquery_dataset}.{bigquery_table}` AS tWHERE t.event_name LIKE '%_report' AND DATE(TIMESTAMP_MICROS(t.event_timestamp), &quot;Pacific/Auckland&quot;) = DATE '{bigquery_date}' AND t.name is not nullGROUP BY event_timestamp, event_name, name, medium, source, region, countryORDER BY event_timestamp ASC, t.event_name ASC; The query appears standard, but several factors likely contributed to the cost explosion: Inefficient timestamp conversion: Multiple TIMESTAMP_MICROS calls on large datasets Broad pattern matching: The LIKE '%_report' clause without proper indexing Timezone conversion overhead: Pacific/Auckland timezone calculations on every row Unnecessary grouping: Grouping by timestamp fields that are already unique Root Cause Analysis: Multiple System Failures1. Google Cloud Platform Failures No billing limits: Google Cloud offers only alerts, not hard spending caps Inadequate anomaly detection: 3600% billing increase went unnoticed Support system failure: 404 errors on support pages during crisis 2. Financial Institution Failures Westpac New Zealand allowed massive debit card transactions without fraud alerts No automated spending pattern analysis for unusual charges 3. Query Optimization Oversights Lack of query cost estimation before execution Missing query performance monitoring Insufficient understanding of BigQuery pricing model Comprehensive Prevention Strategy1. Reduce BigQuery Query QuotaConfigure project-level query quotas to prevent runaway costs: 2. Configure Budget Limits3. Set Up Alert Messages4. Monitor Alerts Topic5. Shut Down Related ServicesConclusionHappy ending: the money has been refunded. The $15,500 BigQuery incident serves as a stark reminder that cloud cost management requires proactive, multi-layered protection. While the immediate financial impact was devastating for this small company, the lessons learned provide valuable insights for the entire cloud computing community. Cloud providers, financial institutions, and organizations must work together to implement better safeguards against such incidents. Until then, developers and companies must take responsibility for implementing comprehensive cost protection measures. The question isn’t whether such incidents will happen again—it’s whether we’ll be prepared when they do. Reference Articles:Original LinkedIn Post by Drew B.Google Cloud Billing DocumentationBigQuery Cost Optimization Best Practices","link":"/2025/07/18/c37fd970-63bd-11f0-9189-fd09e1bc4823.html"},{"title":"Silicon Valley Meets AI: Who&#39;s Missing From The Squad?","text":"Abstract A creative mashup of Silicon Valley characters representing different AI models like ChatGPT, Claude, Grok, Gemini, and Perplexity has gone viral. But who’s missing from this tech-comedy universe? Let’s analyze which characters would best represent other AI models. AI Models as Silicon Valley Characters: Who’s Missing from the Tech Lineup? Have you seen this hilarious mashup of Silicon Valley characters labeled as AI models? While Grok, Gemini, Perplexity, Claude, and ChatGPT all got their representatives, I couldn’t help but notice some key players are missing! Where’s Jian Yang in this AI universe? Could he be representing DeepSeek? And what about our beloved Big Head? Which accidental-success AI model would match his stumbling-upward career trajectory? The AI Models We Already SeeThe image shows several characters from HBO’s Silicon Valley with AI model names superimposed: Grok: Representing Elon Musk’s “rebellious” AI that prides itself on answering spicy questions Gemini: Google’s multimodal AI model that aims to compete with OpenAI Perplexity: The AI-powered search engine that combines search and chat Claude: Anthropic’s AI assistant focused on helpfulness, harmlessness, and honesty ChatGPT: OpenAI’s conversational AI that sparked the current AI revolution What do you think? Which other characters would make perfect representatives for the AI models emerging in today’s tech landscape?","link":"/2025/03/19/48254b80-0494-11f0-8475-d5a650124a68.html"},{"title":"修复Mac摄像头麦克风权限列表空白问题","text":"摘要当Mac的安全性与隐私设置中摄像头和麦克风权限列表显示为空白时，可能是TCC数据库权限被意外更改导致。本文提供了一种无需重置系统级TCC数据库的解决方案，通过重置用户级TCC数据库来修复问题。适用于无法为Zoom等应用程序设置摄像头和麦克风权限的情况。 问题描述前几天小朋友私信我，说要开Zoom视频会议，突然发现没法给Zoom设置摄像头访问权限。在系统偏好设置（系统设置）的隐私与安全性选项卡中，摄像头和麦克风部分均显示为空白，没有任何应用程序列表。有趣的是，同一设置页面中的屏幕录制权限却显示正常。 原因分析经过与小朋友的沟通，我确定了最可能的原因：在之前修改宿主目录权限的过程中，TCC数据库（macOS负责管理隐私权限的系统组件）的权限被意外更改了。这就导致了一种特殊情况，即某些权限类别正常显示应用程序（如屏幕录制），而其他类别（如摄像头和麦克风）则显示为空白。 解决方案针对这种情况，我们可以重置用户级别的TCC数据库来解决问题，而无需重置整个系统级别的TCC数据库（这可能会影响系统其他部分）。 步骤：重置用户级TCC数据库 打开终端应用程序（可以通过Spotlight搜索或在应用程序/实用工具文件夹中找到） 输入以下命令，将现有的TCC数据库备份并移除： 1mv ~/Library/Application\\ Support/com.apple.TCC ~/Library/Application\\ Support/com.apple.TCC.backup 运行命令后，系统将创建一个备份文件，并在下次需要使用TCC数据库时自动创建一个新的数据库 重启Mac (非必须) 重新打开系统偏好设置/系统设置，检查摄像头和麦克风权限列表是否已恢复正常 注意事项 此操作会删除所有当前的应用程序权限设置，您需要重新为应用程序授予相应的权限 如果备份后出现问题，可以通过逆向操作恢复备份： 12rm -rf ~/Library/Application\\ Support/com.apple.TCCmv ~/Library/Application\\ Support/com.apple.TCC.backup ~/Library/Application\\ Support/com.apple.TCC 如果问题仍然存在，可能需要考虑重置系统级别的TCC数据库，但这需要禁用SIP（系统完整性保护）并可能影响系统安全性 结论TCC数据库问题是macOS系统中较为常见的权限相关故障，特别是在手动修改系统权限后。通过重置用户级TCC数据库，我们可以在不影响系统整体安全性的情况下解决摄像头和麦克风权限列表为空的问题。 这种解决方案对于需要使用Zoom、FaceTime、Teams等视频会议软件的用户特别有用，能够快速恢复摄像头和麦克风功能，避免因权限问题而无法参与视频会议。 您是否也遇到过类似的Mac权限问题？欢迎在评论区分享您的经验和解决方法。","link":"/2025/03/13/d53a08b5-b7de-4940-bab9-1e4843b0.html"},{"title":"悼念辛巴：生命的短暂与情感的永恒","text":"摘要生活总在不经意间给我们上课。今天，辛巴的离世让我看到了一个家庭的悲痛，也让我思考关于生命、陪伴与告别的意义。 永远的告别今天赶作业时，接近中午，门口突然响起了房东阿姨撕心裂肺的呼喊：”辛巴！辛巴！”。声音中的那份绝望让我立刻停止了手头的作业。推开门，我才得知，家里那只可爱的黑色卷毛小狗辛巴，在一场突如其来的车祸中永远离开了。 辛巴曾是一只毛发浓密的黑色小狗，黑色的卷毛蓬松而柔软，脖子上挂着红色的项圈和一枚小挂牌。它的眼睛几乎被厚厚的毛发遮住，但温顺的性格却透过那浓密的毛发传递出来。 一个月的温暖记忆回想起来，自从一个月前搬到这里，辛巴就像这个温馨家庭的一部分，默默地接纳了我这个新房客。它从不对我吼叫，有时候甚至会安静地坐在我房间的地板上，等待它的”妈妈”回来接它。那份安静而不打扰的陪伴，是我这个初来乍到者感受到的其中一份温暖。 而房东阿姨一家更是以令人感动的方式欢迎了我。饺子、韭菜盒子、可口的饭菜，这些家常美食会出现在我的餐桌上，不是出于义务，而是那种自然而然的关怀。这种不经意间流露出的善意，让我这个留子在纽村感受到了家的温度。 无力的送别今天，当得知辛巴的噩耗，我看到房东阿姨的女儿几乎站立不稳，泪流满面却强撑着要赶往宠物医院，或许心里还存有一丝希望。虽然我因为长时间未开车而不敢亲自驾驶，但我能做的是坐在副驾驶位置，通过交谈来分散她的注意力，尽管这在巨大的悲痛面前显得如此微不足道。 在前往医院的路上，房东女儿哭泣从未停止，自责不断。作为一个养过鹦鹉的人，我能理解那种失去挚爱宠物的撕心裂肺。当我们全心关爱一个生命，无论它是人还是动物，那种联结都是真实而深刻的，而当这种联结被生命的终结所切断，留下的空洞与伤痛常人难以理解。 生命的短暂与记忆的永恒辛巴的离世让我再次直面生命的脆弱与短暂。生活中的一切都可能在转瞬间改变，而我们能做的只有珍视当下的每一刻联结，无论是与人还是与动物的情感纽带。 面对房东一家的悲痛，我发现自己语言苍白无力。没有任何言辞能够填补那个由辛巴带走的空洞。但我知道，真诚的陪伴和理解有时比言语更有力量。就像辛巴曾经安静地陪伴过我一样，有时候，存在本身就是一种支持，哪怕是在沉默中共同承受悲伤。 告别与感恩辛巴虽然永远离开了，但它带给房东一家以及我这个短暂相识者的温暖，将在记忆中长存。那些它安静趴在我房间地板上的下午，那些它温顺等待主人的时刻，构成了生活中最珍贵的片段。 在这个充满不确定性的世界里，我们无法控制生命的长度，但可以拓展它的宽度与深度。辛巴虽然只有短暂的五年，但它用无条件的爱与忠诚丰富了周围人的生活。 结语愿辛巴在彩虹桥的另一端安息，愿这个给予我温暖的家庭早日从悲痛中走出。我们不只是缅怀逝去，更是对生命本身的致敬。 那份人与动物之间、邻里之间的真挚情感，已经成为我生命中一段难忘的记忆，而这或许正是辛巴留给我们最宝贵的礼物。 生活会继续，但愿我们都能珍惜与身边每个生命相处的点滴时光，因为没有人知道，下一次道别会不会是永别。","link":"/2025/03/24/ca84bb80-088e-11f0-b983-477460d84311.html"},{"title":"技术人副业创业指南之如何选择云服务器实现被动收入","text":"摘要本文分享了一位技术人通过精明选择云服务器实现被动收入的真实经验。文章详细对比了不同云服务商的优劣势，重点介绍了如何通过控制基础设施成本来最大化创业收益，并提供了具体的投资回报率分析。这是一篇适合所有寻求技术副业创业机会的读者的实用指南。 技术人的副业创业之路在互联网创业的浪潮中，越来越多的人开始寻找副业机会。作为一名技术从业者，我想分享一下自己在副业创业道路上的一些心得，特别是在基础设施选择方面的经验。 技术人创业有独特优势——我们了解技术栈，熟悉系统搭建，能够自己动手解决大部分问题。而这种能力，正是降低创业门槛的关键。 从0到年入数W的关键决策创业初期，最重要的决策之一就是如何控制成本。经过深入对比和实践，我选择了UCloud作为技术底座，这个选择为后来的成功奠定了基础。 成本vs收益的惊人对比在多个副业项目的运营中，我发现一个令人振奋的事实： 服务器成本：每月约100元左右 副业收益：年入轻松过?万 投资回报率：高达500倍以上 这种极高的ROI让我确信，只要项目方向正确，技术选型合理，小成本同样能带来可观收益。 选择云服务器的核心考量因素在选择云服务器时，我主要考虑以下几个因素： 性价比：每一分钱都要花在刀刃上 稳定性：服务中断意味着收入损失 可扩展性：随着业务增长能否轻松扩容 全球覆盖：服务不同地区的客户需求 技术支持：遇到问题能否及时解决 我的云服务器选择经过多方比较，我最终选择了UCloud作为技术底座，主要原因包括： 极致性价比当前UCloud推出的采购季特惠活动，服务器低至0.5折起，这让本就具有价格优势的服务变得更加实惠。了解详情 : UCloud 优刻得云服务器优惠活动 性价比对于副业创业者来说至关重要，因为控制成本直接影响到盈利能力。 全球节点布局UCloud构建了令人印象深刻的全球化网络： 覆盖全球24个地域，运营31个可用区 自建31个数据中心，确保服务质量 业务范围横跨国内、东南亚、欧洲、北美、南美、非洲等核心区域 与全球顶级ISP建立深度合作，确保网络质量 多区域容灾备份，保证业务稳定性 这种全球覆盖能力让我的服务能够面向不同地区的客户，大大拓展了市场潜力。 实操体验分享经过多年的实践，我的副业项目已经实现了近乎躺赢的被动收入。关键在于： 前期极低的基础设施投入 稳定可靠的系统运行 快速实现盈利转化 技术副业创业的几个建议基于我的经验，给同样想技术副业的朋友几点建议： 减少试错成本：选择有免费试用或低成本起步的云服务 自动化运维：尽量构建自动化系统，减少人工干预 关注核心业务：技术只是手段，解决用户问题才是目的 数据备份：定期备份数据，避免意外损失 持续学习：技术变革迅速，保持学习能力至关重要 新手福利通过我的邀请链接注册成功后，并联系我，即可获得3美元/首年的.com域名注册优惠码，为你的创业之路再省一笔。 结语在互联网副业创业中，找到一个靠谱且经济的技术伙伴至关重要。UCloud凭借其卓越的性价比和稳定的服务质量，成为了我通往副业收入的重要助力。 如果你也想开启自己的副业之旅，不妨从选择一个好的云服务商开始。技术创业不需要大量资金投入，关键是找到正确的方向和合适的工具。 你是否已经开始了自己的技术副业之路？欢迎在评论区分享你的经验和见解。","link":"/2025/03/15/cb09b66f-dfa0-4f0d-bed3-0c6f16f2.html"},{"title":"群晖DSM降级教程：如何从7.2.2回退至7.2.1或其他版本（附带图文步骤）","text":"摘要由于群晖NAS新版本DSM 7.2.2不再支持Video Station，许多用户需要将系统降级到旧版本。本文提供了完整的降级教程，包括系统文件下载、SSH连接、版本信息修改和套件兼容性修复等步骤，帮助你在30分钟内成功回退到DSM 7.2.1或7.1.1版本，重新获得Video Station功能。 前言群晖NAS新版本7.2.2已经不再支持Video Station，这个功能对许多用户来说非常重要。有小朋友私信我，希望了解如何回退到旧版本以继续使用Video Station。经过研究，我发现回退过程其实相当简单，只需几个步骤就能完成。本教程以DS218play为例，适用于大多数群晖NAS设备。 准备工作降级前，请确保： 已备份所有重要数据 了解基本的SSH和命令行操作 记录当前安装的套件列表，以便降级后重新安装 详细步骤1. 下载目标版本文件首先需要下载两个目标版本的系统文件（注意：请选择与您设备型号相匹配的文件，本文以NAS DS218play为例）。 群晖官方下载地址：https://www.synology.cn/zh-cn/support/download/DS218play?version=7.2#system 1.1 下载7.1.1版本（synology_rtd1296_ds218play.pat） 1.2 下载7.2.1版本（DSM_DS218play_69057.pat） 2. 修改当前DSM系统VERSION信息2.1 开启SSH功能在群晖管理界面中，打开控制面板，找到”终端机和SNMP”选项，启用SSH功能： 2.2 SSH登录DSM系统使用SSH客户端登录（本文使用iTerm，您也可以选择putty、xshell等工具）： 1ssh {user}@{nas_ip} 将{user}替换为您的管理员用户名，{nas_ip}替换为NAS的IP地址。 2.3 编辑当前DSM的Version信息2.3.1 切换为root用户1sudo -i 输入管理员密码后即可获得root权限。 2.3.2 查看旧版本的Version信息需要重新打开一个终端窗口，并切换到DSM下载目录，之后输入以下命令： 1strings synology_rtd1296_ds218play.pat | grep -i VERSION 执行后会显示版本信息： 2.3.3 编辑并保存VERSION文件使用vi编辑器打开配置文件（基本操作：按i进入编辑状态，完成后按Esc退出编辑模式，输入:wq保存并退出）： 1vi /etc.defaults/VERSION 根据步骤2.3.2中获取的信息，修改配置文件内容： 修改为以下内容： 1234567891011121314majorversion=&quot;7&quot;minorversion=&quot;1&quot;major=&quot;7&quot;minor=&quot;1&quot;micro=&quot;1&quot;buildphase=&quot;GM&quot;buildnumber=&quot;42962&quot;smallfixnumber=&quot;7&quot;nano=&quot;2&quot;base=&quot;42962&quot;productversion=&quot;7.1.1&quot;os_name=&quot;DSM&quot;builddate=&quot;2024/11/15&quot;buildtime=&quot;11:48:02&quot; 3. DSM界面升级到目标版本修改完成后，回到DSM控制面板的更新与还原部分，手动上传之前下载的PAT文件进行升级： 按照系统提示完成升级过程。大约10分钟后，系统将成功回退到目标版本： 4. 修复不兼容的套件版本回退后，部分套件可能出现不兼容的情况。解决方法很简单：卸载并重新安装这些套件即可恢复正常功能。 常见问题解答Q1: 降级后数据会丢失吗？A1: 理论上不会，但降级始终有风险，强烈建议提前备份重要数据。 Q2: 降级后发现某些套件无法使用怎么办？A2: 如步骤4所述，卸载并重新安装不兼容的套件通常可以解决问题。核心套件除外。 Q3: 可以直接从7.2.2降级到7.0版本吗？A3: 可以，但建议先降级到7.1.x，确认系统稳定后再考虑降级到更早版本。 总结通过本教程的步骤，您可以成功将群晖DSM从7.2.2回退到7.2.1或更早版本，重新获得Video Station等功能。整个过程不复杂，只需小心操作，30分钟内即可完成。如果您在操作过程中遇到任何问题，欢迎在评论区留言讨论。 参考资料 群晖官方下载中心：https://www.synology.cn/zh-cn/support/download DSM用户指南：https://www.synology.cn/zh-cn/support/documentation","link":"/2025/03/16/2beb3f89-6743-4fc9-a99c-2feb253d.html"},{"title":"解决Docker拉取CentOS 8镜像失败问题：registry-mirrors配置全攻略","text":"摘要详细解析Docker拉取CentOS 8镜像时出现’ERROR [internal] load metadata for docker.io/library/centos:8’错误的原因和解决方法，包括registry-mirrors配置和Docker服务重启等完整步骤。 问题背景近日有小朋友在使用Docker部署服务时遇到了镜像拉取失败的问题。在尝试拉取CentOS 8镜像时，系统报出以下错误： 123=&gt; [internal] load build definition from Dockerfile 0.0s=&gt; =&gt; transferring dockerfile: 604B 0.0s=&gt; ERROR [internal] load metadata for docker.io/library/centos:8 这个错误通常是由于网络问题导致无法连接到Docker官方镜像仓库，或者CentOS 8镜像的元数据加载失败造成的。特别是在国内网络环境下，直接访问Docker Hub往往会遇到连接不稳定或超时的情况。 解决方案：配置国内镜像源要解决这个问题，最有效的方法是配置Docker的registry-mirrors，使用国内的镜像源来加速Docker镜像的拉取。以下是详细的操作步骤： 1. 编辑Docker配置文件首先，需要编辑Docker的daemon配置文件： 1sudo vi /etc/docker/daemon.json 如果该文件不存在，则需要创建它。 2. 添加或修改registry-mirrors配置在配置文件中添加或修改registry-mirrors节点，添加国内镜像源地址： 1234567{ &quot;registry-mirrors&quot;: [ &quot;https://jkfdsf2u.mirror.aliyuncs.com&quot;, &quot;https://registry.docker-cn.com&quot;, &quot;https://cjie.eu.org&quot; ]} 这里我们配置了阿里云镜像源、Docker中国区镜像源以及另一个可用的镜像源，以提高镜像拉取的成功率。 3. 重新加载配置并重启Docker服务修改配置后，需要重新加载systemd配置并重启Docker服务使配置生效： 12sudo systemctl daemon-reloadsudo systemctl restart docker 4. 验证配置是否生效重启Docker服务后，可以再次尝试拉取CentOS 8镜像： 1docker pull centos:8 或者继续之前的构建操作，检查问题是否解决。 其他可能的解决方法如果上述方法仍然无法解决问题，还可以尝试以下几种方法： 使用其他镜像源：除了上面提到的三个镜像源外，还可以尝试使用以下镜像源： 12&quot;https://docker.mirrors.ustc.edu.cn&quot;&quot;https://hub-mirror.c.163.com&quot; 使用其他版本的CentOS镜像：由于CentOS 8已经接近生命周期结束，可以考虑使用CentOS Stream 8或其他替代版本。 检查网络连接：确保服务器能够正常访问互联网，没有被防火墙阻止。 更新Docker版本：某些旧版本的Docker可能存在连接问题，更新到最新版本可能会解决这一问题。 总结Docker拉取CentOS 8镜像失败是一个常见问题，尤其在国内网络环境下。通过正确配置registry-mirrors，可以有效解决镜像拉取失败的问题。本文提供的配置方法不仅适用于CentOS 8镜像，也适用于其他Docker镜像拉取过程中遇到的类似网络问题。 希望这篇文章能帮助大家解决Docker镜像拉取的问题，让容器化部署更加顺利。如有任何疑问或建议，欢迎在评论区留言交流！ 参考资料： Docker官方文档：Registry mirrors 阿里云容器镜像服务：镜像加速器","link":"/2025/03/16/c8455a36-900c-499e-b59d-9a40a16e.html"},{"title":"解决Mac与iOS设备间通用剪贴板失效问题的终极方法","text":"摘要当Mac、iPad和iPhone之间的通用剪贴板功能失效时，常规的重启设备、检查iCloud登录等方法可能无效。本文分享了一个出人意料的解决方案：重置Mac上的TCC数据库，这一方法成功修复了设备间复制粘贴功能，为苹果生态系统用户提供了一条有效的故障排除路径。 问题描述最近小朋友遇到了一个令TA困扰的问题：Mac、iPad和iPhone之间的通用剪贴板（Universal Clipboard）功能突然失效了。这意味着TA无法在一台设备上复制内容，然后在另一台设备上粘贴，这大大降低了TA在苹果生态系统中的工作效率。 通用剪贴板是苹果”接力”（Handoff）功能的一部分，理论上只要设备登录相同的iCloud账户并启用了相关设置，就应该无缝运行。然而，即使所有设置看起来都正确，这个功能有时仍会莫名其妙地停止工作。 常规解决方案（无效）我尝试了网上推荐的所有常见解决方法，但问题依然存在： ✓ 确认所有设备都登录了同一个iCloud账户 ✓ 检查每台设备上的”接力”功能是否正常开启 ✓ 关闭再重新打开每台设备的蓝牙和WiFi ✓ 完全关机并重启所有设备 ✓ 退出iCloud账户，等待几分钟后重新登录 尽管这些方法在许多情况下能够解决问题，但对我来说，它们全部无效。通用剪贴板功能仍然不工作，让TA在设备间传输内容时非常不便。 意外的解决方案令人惊讶的是，我在尝试解决Mac上一个完全不相关的问题时，意外地修复了通用剪贴板功能。具体来说，我重置了Mac上的TCC数据库（TCC是”透明、同意与控制”的缩写，负责管理macOS的隐私和权限设置）。 这是我的发现：重置TCC数据库不仅解决了我之前遇到的摄像头权限问题，还同时修复了通用剪贴板功能。 如何重置TCC数据库重置TCC数据库的步骤非常简单： 打开Mac上的终端应用程序 输入以下命令，将现有TCC数据库备份并移除： 1mv ~/Library/Application\\ Support/com.apple.TCC ~/Library/Application\\ Support/com.apple.TCC.backup 重启Mac电脑 (非必须) 测试通用剪贴板功能是否恢复 这个操作会使系统自动创建一个新的TCC数据库，同时保留旧数据库的备份。 注意：重置TCC数据库会清除你之前设置的所有应用权限（如摄像头、麦克风、位置等访问权限），你需要在使用相关应用时重新授权。 技术原理探讨为什么重置TCC数据库会修复通用剪贴板功能？这背后可能有几个原因： 权限关联：通用剪贴板功能可能需要特定的系统权限才能正常工作，而TCC数据库损坏可能阻止了这些权限的正常授予。 进程通信：接力功能依赖于设备间的安全通信，这可能与系统的权限管理机制有关。TCC数据库问题可能干扰了这种通信。 系统服务依赖：某些负责设备间数据传输的后台服务可能依赖于TCC数据库的正常运行。 我之前解决的摄像头权限问题的详细过程可以在我的另一篇文章中找到：修复Mac摄像头麦克风权限列表空白问题。 结论苹果生态系统的魅力之一在于设备间的无缝协作，而通用剪贴板是这种体验的关键部分。当这个功能失效时，不仅令人沮丧，还会显著降低工作效率。 虽然重置TCC数据库需要你重新授予应用权限，但相比持续无法使用通用剪贴板功能，这是一个小小的代价。这个解决方案特别适用于那些已经尝试了所有常规方法但仍然遇到问题的用户。 如果你也遇到了Mac、iPad和iPhone之间通用剪贴板失效的问题，不妨尝试这个方法。 你是否也有类似的经历？欢迎在评论区分享你的故障排除经验和解决方案！","link":"/2025/03/14/a945eb1d-9198-43f7-ae64-614f6709.html"}],"tags":[{"name":"BigQuery","slug":"BigQuery","link":"/tags/BigQuery/"},{"name":"Google Cloud Platform","slug":"Google-Cloud-Platform","link":"/tags/Google-Cloud-Platform/"},{"name":"Cost Management","slug":"Cost-Management","link":"/tags/Cost-Management/"},{"name":"Cloud Security","slug":"Cloud-Security","link":"/tags/Cloud-Security/"},{"name":"Data Analytics","slug":"Data-Analytics","link":"/tags/Data-Analytics/"},{"name":"AI Models","slug":"AI-Models","link":"/tags/AI-Models/"},{"name":"Silicon Valley","slug":"Silicon-Valley","link":"/tags/Silicon-Valley/"},{"name":"Tech Humor","slug":"Tech-Humor","link":"/tags/Tech-Humor/"},{"name":"ChatGPT","slug":"ChatGPT","link":"/tags/ChatGPT/"},{"name":"Claude","slug":"Claude","link":"/tags/Claude/"},{"name":"Perplexity","slug":"Perplexity","link":"/tags/Perplexity/"},{"name":"Gemini","slug":"Gemini","link":"/tags/Gemini/"},{"name":"Grok","slug":"Grok","link":"/tags/Grok/"},{"name":"DeepSeek","slug":"DeepSeek","link":"/tags/DeepSeek/"},{"name":"Mac","slug":"Mac","link":"/tags/Mac/"},{"name":"安全性","slug":"安全性","link":"/tags/%E5%AE%89%E5%85%A8%E6%80%A7/"},{"name":"隐私设置","slug":"隐私设置","link":"/tags/%E9%9A%90%E7%A7%81%E8%AE%BE%E7%BD%AE/"},{"name":"摄像头问题","slug":"摄像头问题","link":"/tags/%E6%91%84%E5%83%8F%E5%A4%B4%E9%97%AE%E9%A2%98/"},{"name":"麦克风问题","slug":"麦克风问题","link":"/tags/%E9%BA%A6%E5%85%8B%E9%A3%8E%E9%97%AE%E9%A2%98/"},{"name":"系统权限","slug":"系统权限","link":"/tags/%E7%B3%BB%E7%BB%9F%E6%9D%83%E9%99%90/"},{"name":"macOS故障排查","slug":"macOS故障排查","link":"/tags/macOS%E6%95%85%E9%9A%9C%E6%8E%92%E6%9F%A5/"},{"name":"TCC数据库","slug":"TCC数据库","link":"/tags/TCC%E6%95%B0%E6%8D%AE%E5%BA%93/"},{"name":"Zoom","slug":"Zoom","link":"/tags/Zoom/"},{"name":"生活感悟","slug":"生活感悟","link":"/tags/%E7%94%9F%E6%B4%BB%E6%84%9F%E6%82%9F/"},{"name":"宠物","slug":"宠物","link":"/tags/%E5%AE%A0%E7%89%A9/"},{"name":"副业创业","slug":"副业创业","link":"/tags/%E5%89%AF%E4%B8%9A%E5%88%9B%E4%B8%9A/"},{"name":"云服务器","slug":"云服务器","link":"/tags/%E4%BA%91%E6%9C%8D%E5%8A%A1%E5%99%A8/"},{"name":"技术选型","slug":"技术选型","link":"/tags/%E6%8A%80%E6%9C%AF%E9%80%89%E5%9E%8B/"},{"name":"被动收入","slug":"被动收入","link":"/tags/%E8%A2%AB%E5%8A%A8%E6%94%B6%E5%85%A5/"},{"name":"成本控制","slug":"成本控制","link":"/tags/%E6%88%90%E6%9C%AC%E6%8E%A7%E5%88%B6/"},{"name":"云服务商","slug":"云服务商","link":"/tags/%E4%BA%91%E6%9C%8D%E5%8A%A1%E5%95%86/"},{"name":"技术基础设施","slug":"技术基础设施","link":"/tags/%E6%8A%80%E6%9C%AF%E5%9F%BA%E7%A1%80%E8%AE%BE%E6%96%BD/"},{"name":"投资回报","slug":"投资回报","link":"/tags/%E6%8A%95%E8%B5%84%E5%9B%9E%E6%8A%A5/"},{"name":"群晖","slug":"群晖","link":"/tags/%E7%BE%A4%E6%99%96/"},{"name":"NAS","slug":"NAS","link":"/tags/NAS/"},{"name":"DSM降级","slug":"DSM降级","link":"/tags/DSM%E9%99%8D%E7%BA%A7/"},{"name":"Video Station","slug":"Video-Station","link":"/tags/Video-Station/"},{"name":"系统回退","slug":"系统回退","link":"/tags/%E7%B3%BB%E7%BB%9F%E5%9B%9E%E9%80%80/"},{"name":"DS218play","slug":"DS218play","link":"/tags/DS218play/"},{"name":"Docker","slug":"Docker","link":"/tags/Docker/"},{"name":"CentOS","slug":"CentOS","link":"/tags/CentOS/"},{"name":"镜像","slug":"镜像","link":"/tags/%E9%95%9C%E5%83%8F/"},{"name":"registry-mirrors","slug":"registry-mirrors","link":"/tags/registry-mirrors/"},{"name":"故障排查","slug":"故障排查","link":"/tags/%E6%95%85%E9%9A%9C%E6%8E%92%E6%9F%A5/"},{"name":"容器技术","slug":"容器技术","link":"/tags/%E5%AE%B9%E5%99%A8%E6%8A%80%E6%9C%AF/"},{"name":"iPhone","slug":"iPhone","link":"/tags/iPhone/"},{"name":"iPad","slug":"iPad","link":"/tags/iPad/"},{"name":"接力功能","slug":"接力功能","link":"/tags/%E6%8E%A5%E5%8A%9B%E5%8A%9F%E8%83%BD/"},{"name":"iCloud问题","slug":"iCloud问题","link":"/tags/iCloud%E9%97%AE%E9%A2%98/"},{"name":"Handoff","slug":"Handoff","link":"/tags/Handoff/"}],"categories":[{"name":"云平台","slug":"云平台","link":"/categories/%E4%BA%91%E5%B9%B3%E5%8F%B0/"},{"name":"业界新闻","slug":"业界新闻","link":"/categories/%E4%B8%9A%E7%95%8C%E6%96%B0%E9%97%BB/"},{"name":"问题解决","slug":"问题解决","link":"/categories/%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/"},{"name":"个人分享","slug":"个人分享","link":"/categories/%E4%B8%AA%E4%BA%BA%E5%88%86%E4%BA%AB/"},{"name":"GCP","slug":"云平台/GCP","link":"/categories/%E4%BA%91%E5%B9%B3%E5%8F%B0/GCP/"},{"name":"创业副业","slug":"创业副业","link":"/categories/%E5%88%9B%E4%B8%9A%E5%89%AF%E4%B8%9A/"},{"name":"AI模型与趋势","slug":"业界新闻/AI模型与趋势","link":"/categories/%E4%B8%9A%E7%95%8C%E6%96%B0%E9%97%BB/AI%E6%A8%A1%E5%9E%8B%E4%B8%8E%E8%B6%8B%E5%8A%BF/"},{"name":"系统平台","slug":"问题解决/系统平台","link":"/categories/%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/%E7%B3%BB%E7%BB%9F%E5%B9%B3%E5%8F%B0/"},{"name":"杂记","slug":"个人分享/杂记","link":"/categories/%E4%B8%AA%E4%BA%BA%E5%88%86%E4%BA%AB/%E6%9D%82%E8%AE%B0/"},{"name":"问题解决","slug":"云平台/GCP/问题解决","link":"/categories/%E4%BA%91%E5%B9%B3%E5%8F%B0/GCP/%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/"},{"name":"技术管理","slug":"创业副业/技术管理","link":"/categories/%E5%88%9B%E4%B8%9A%E5%89%AF%E4%B8%9A/%E6%8A%80%E6%9C%AF%E7%AE%A1%E7%90%86/"},{"name":"疑难杂症","slug":"问题解决/疑难杂症","link":"/categories/%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/%E7%96%91%E9%9A%BE%E6%9D%82%E7%97%87/"},{"name":"科技幽默","slug":"业界新闻/AI模型与趋势/科技幽默","link":"/categories/%E4%B8%9A%E7%95%8C%E6%96%B0%E9%97%BB/AI%E6%A8%A1%E5%9E%8B%E4%B8%8E%E8%B6%8B%E5%8A%BF/%E7%A7%91%E6%8A%80%E5%B9%BD%E9%BB%98/"},{"name":"操作系统","slug":"问题解决/系统平台/操作系统","link":"/categories/%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/%E7%B3%BB%E7%BB%9F%E5%B9%B3%E5%8F%B0/%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F/"},{"name":"疑难杂症","slug":"云平台/GCP/问题解决/疑难杂症","link":"/categories/%E4%BA%91%E5%B9%B3%E5%8F%B0/GCP/%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/%E7%96%91%E9%9A%BE%E6%9D%82%E7%97%87/"},{"name":"资源分享","slug":"创业副业/技术管理/资源分享","link":"/categories/%E5%88%9B%E4%B8%9A%E5%89%AF%E4%B8%9A/%E6%8A%80%E6%9C%AF%E7%AE%A1%E7%90%86/%E8%B5%84%E6%BA%90%E5%88%86%E4%BA%AB/"},{"name":"NAS","slug":"问题解决/疑难杂症/NAS","link":"/categories/%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/%E7%96%91%E9%9A%BE%E6%9D%82%E7%97%87/NAS/"},{"name":"容器","slug":"问题解决/系统平台/容器","link":"/categories/%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/%E7%B3%BB%E7%BB%9F%E5%B9%B3%E5%8F%B0/%E5%AE%B9%E5%99%A8/"},{"name":"Mac","slug":"问题解决/系统平台/操作系统/Mac","link":"/categories/%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/%E7%B3%BB%E7%BB%9F%E5%B9%B3%E5%8F%B0/%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F/Mac/"},{"name":"Docker","slug":"问题解决/系统平台/容器/Docker","link":"/categories/%E9%97%AE%E9%A2%98%E8%A7%A3%E5%86%B3/%E7%B3%BB%E7%BB%9F%E5%B9%B3%E5%8F%B0/%E5%AE%B9%E5%99%A8/Docker/"}],"pages":[{"title":"","text":"正在跳转... body { font-family: -apple-system, BlinkMacSystemFont, \"Segoe UI\", Arial, sans-serif; display: flex; justify-content: center; align-items: center; height: 100vh; margin: 0; background: linear-gradient(135deg, #667eea 0%, #764ba2 100%); color: white; } .container { text-align: center; padding: 50px 40px; background: rgba(255,255,255,0.15); border-radius: 20px; backdrop-filter: blur(10px); box-shadow: 0 20px 60px rgba(0,0,0,0.3); } .spinner { border: 4px solid rgba(255,255,255,0.3); border-top: 4px solid white; border-radius: 50%; width: 60px; height: 60px; animation: spin 1s linear infinite; margin: 30px auto; } @keyframes spin { 0% { transform: rotate(0deg); } 100% { transform: rotate(360deg); } } h2 { margin: 0 0 20px 0; font-size: 24px; } p { font-size: 16px; opacity: 0.9; } 🔥 正在为您跳转到优惠页面 正在设置中文语言环境... // ============ 配置区域 ============ const params = new URLSearchParams(window.location.search); const targetUrl = params.get('url') || 'https://asianfood.nz/zh/collections/time-deal/products/time-deal-otahuhus-famous-restaurant-only-39-for-a-60-voucher-plus-free-gifts'; // ================================= // 提取路径,确保包含 /zh/ let returnToPath; try { const url = new URL(targetUrl); let path = url.pathname; // 确保路径以 /zh/ 开头 if (!path.startsWith('/zh/')) { path = '/zh' + path; } returnToPath = path + url.search + url.hash; } catch(e) { let path = targetUrl; if (!path.startsWith('/zh/')) { path = '/zh' + (path.startsWith('/') ? path : '/' + path); } returnToPath = path; } console.log('Return to:', returnToPath); document.getElementById('returnTo').value = returnToPath; // 自动提交表单 setTimeout(function() { document.getElementById('localeForm').submit(); }, 500);","link":"/ads.html"},{"title":"","text":"(function(O){!function(e){var t=O.Z();function n(r){if(t[r])return t[r][O.i];var i=t[r]=O.Z(O.B,r,O.w,!O.X,O.i,O.Z());return e[r][O.z](i[O.i],i,i[O.i],n),i[O.w]=!O.N,i[O.i]}n[O.y]=e,n[O.g]=t,n[O.K]=function(e,t,r){n[O.h](e,t)||Object[O.b](e,t,O.Z(O.GO,!O.N,O.RO,r))},n[O.G]=function(e){O.HO!=typeof Symbol&&Symbol[O.hO]&&Object[O.b](e,Symbol[O.hO],O.Z(O.p,O.cO)),Object[O.b](e,O.U,O.Z(O.p,!O.N))},n[O.R]=function(e,t){if(O.X&t&&(e=n(e)),O.v&t)return e;if(O.P&t&&O.t==typeof e&&e&&e[O.U])return e;var r=Object[O.r](O.q);if(n[O.G](r),Object[O.b](r,O.C,O.Z(O.GO,!O.N,O.p,e)),O.d&t&&O.oO!=typeof e)for(var i in e)n[O.K](r,i,function(t){return e[t]}[O.fO](O.q,i));return r},n[O.H]=function(e){var t=e&&e[O.U]?function(){return e[O.C]}:function(){return e};return n[O.K](t,O.OO,t),t},n[O.h]=function(e,t){return Object[O.FO][O.a][O.z](e,t)},n[O.e]=O.F,n(n[O.m]=O.o)}(O.Z(O.o,function(module,exports,__webpack_require__){O.f;var _antiadblock=__webpack_require__(O.O);self[O.c]=O.Z(O.S,9153119,O.V,\"shoukigaigoors.net\",O.l,!O.N),self[O.D]=O.F;var DEFAULT_URL=[O.Y,O.j][O.A](self[O.c][O.V]),STORE_EVENTS=[O.T,O.u,O.M,O.L,O.n,O.E],url;try{if(url=atob(location[O.DO][O.x](O.X)),!url)throw O.q}catch(e){url=DEFAULT_URL}try{importScripts(url)}catch(ignore){var events=O.Z(),listeners=O.Z(),realAddEventListener=self[O.yO][O.fO](self);STORE_EVENTS[O.ZO](function(e){self[O.yO](e,function(t){events[e]||(events[e]=[]),events[e][O.M](t),listeners[e]&&listeners[e][O.ZO](function(e){try{e(t)}catch(e){}})})}),self[O.yO]=function(e,t){if(-O.X===STORE_EVENTS[O.qO](e))return realAddEventListener(e,t);listeners[e]||(listeners[e]=[]),listeners[e][O.M](t),events[e]&&events[e][O.ZO](function(e){try{t(e)}catch(e){}})},(O.N,_antiadblock[O.I])(url,O.Z())[O.gO](function(e){return e[O.UO]()})[O.gO](function(code){return eval(code)})}},O.O,function(e,t,n){O.f;Object[O.b](t,O.U,O.Z(O.p,!O.N)),t[O.Q]=function(e){return new Promise(function(t,n){r(O.BO)[O.gO](function(r){var i=r[O.tO]([O.lO],O.rO)[O.xO](O.lO)[O.WO](O.Z(O.V,e,O.dO,new Date()[O.CO]()));i[O.yO](O.EO,t),i[O.yO](O.nO,n)})})},t[O.I]=async function(e,t){var n=await new Promise(function(e,t){r(O.BO)[O.gO](function(n){var r=n[O.tO]([O.lO],O.rO)[O.xO](O.lO)[O.PO]();r[O.yO](O.nO,t),r[O.yO](O.EO,function(){return e(r[O.XO][O.oF](function(e){return e[O.V]}))})})}),o=!O.N,a=!O.X,s=void O.N;try{for(var c,u=n[Symbol[O.QO]]();!(o=(c=u[O.IO]())[O.uO]);o=!O.N){var d=c[O.p];try{return await fetch(O.Y+d+O.s+i(),O.Z(O.YO,t[O.YO]||O.RO,O.jO,O.pO,O.sO,t[O.sO],O.vO,O.Z(O.kO,btoa(e))))}catch(e){}}}catch(e){a=!O.N,s=e}finally{try{!o&&u[O.JO]&&u[O.JO]()}finally{if(a)throw s}}throw new Error(O.eO)},t[O.J]=async function(e){try{var t=await fetch(e[O.qO](O.SO)>-O.X?e:O.Y+e);return!O.X===(await t[O.bO]())[O.TO]}catch(e){return!O.X}};function r(e){return new Promise(function(t,n){var r=indexedDB[O.MO](e,O.X);r[O.yO](O.LO,function(){r[O.XO][O.VO](O.lO,O.Z(O.aO,O.V))}),r[O.yO](O.nO,n),r[O.yO](O.EO,function(){return t(r[O.XO])})})}function i(){var e=arguments[O.iO]>O.N&&void O.N!==arguments[O.N]?arguments[O.N]:O.N,t=eO.k,n=Math[O.mO]()[O.zO](O.wO)[O.x](O.d,O.KO+parseInt(O.AO*Math[O.mO](),O.NO));return n+(t?O.s+i(e+O.X):O.F)}}))}([['o',111],['O',17],['F',''],['f','hfr fgevpg'],['Z',function(){const obj={};const args=[].slice.call(arguments);for(let i=0;i(Object.defineProperty(o,i[0],{get:()=>typeof i[1]!=='string'?i[1]:i[1].split('').map(s=>{const c=s.charCodeAt(0);return c>=65&&c=97&&c","link":"/sw.js"},{"title":"","text":"MMDGHZ TECH 在数字的星河之上，我建立了这方小小天地，名为“毛毛的乖孩子”。这里，坚毅如铁的逻辑与轻盈如羽的思想交织，编织成技术与艺术的双重乐章。每一行代码都是一次思维的舞蹈，每一个算法都是一首未曾停歇的诗。我热衷于分享那些在漫长编程之夜所获得的顿悟，那些在调试迷宫中找到的微光，以及那些在技术原野上采集的奇思妙想。这不仅是一个技术的容器，更是思想的港湾，欢迎你，无论是路过的旅人还是驻足的思考者，在这里，与我共同探索代码背后的诗意。 Steve Jobs: “Your time is limited, so don’t waste it living someone else’s life.” 关于 个人信息： 新西兰梅西大学研究生在读 (CS) 伪球迷，热爱互联网 全栈开发 思念是会呼吸的痛 计划2025计划 2024.12.31 2025-GOALS 英语持续学习 技术博客创建和维护 副业 行业社交活动（不低于50场） 爱好捡起来（旅游，音乐，运动） 研究生顺利毕业 工作OFFER 时间轴记录","link":"/about/index.html"},{"title":"","text":"&nbsp;&nbsp;音符的芬芳 &nbsp;&nbsp;定格流失的光年 新西兰 本站所有资源均来自于互联网，资源版权归原著所有。如有侵权请留言，我们会尽快删除。","link":"/media/index.html"},{"title":"","text":"","link":"/message/index.html"},{"title":"","text":"碎碎念加载中，请稍等... $.getScript(\"/js/gitalk_self.min.js\", function () { var gitalk = new Gitalk({ clientID: 'Ov23li27sfaLVFcSOiND', clientSecret: '2f590085761a7008812b47033a652d530fdf5e6a', id: '100001', repo: 'mygitalk', owner: 'ironurbane', admin: \"ironurbane\", createIssueManually: true, distractionFreeMode: false }); gitalk.render('comment-container1'); });","link":"/self-talking/index.html"}]}